import streamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (Title สีเรนโบว์)
st.markdown("# :rainbow[💪เเอปพลิเคชั่นคำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักส่วนสูงของคุณ เพื่อเช็กสุขภาพเบื้องต้น")

#ส่วน 2 สร้างช่องรับค่าน้ำหนัก เเละ ส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ ( กิโลกรัม ):")
hight_cm = st.number_input("กรอกส่วนสูงของคุณ ( เซนติเมตร ):")

#ส่วนที่ 3 สรา้งปุ่มคำนวณ
if st.button("คำนวณค่า BMI🥗"):
      # เเปลงส่วนสูงจสก cm เป็น เมตร เเล้วคำนวณ BMI
      hight_m = hight_cm / 100
      bmi = weight / (hight_m ** 2)

      st.write("---")
      st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 เเปลผลค่า BMI ตามเกณฑ์
      if bmi < 18.5:
          st.warning("คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
      elif 18.5 <= bmi < 23.0:
          st.successs("คุณมีน้ำหนักอยู๋ในเกณฑ์ปกติ (สุขภาพดี)")
      elif 23.0 <= bmi < 25.0:
          st.info("❤️ คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
      else:
          st.error("🚨 คุณอยู๋ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพเเละออกกำลังกาย")
  
st.driver()
st.write("นางสาวพิมพ์ชนก กาไชย เลขที่ 10 ม.4/7")
